let output = ''

for (i = 0; i < 6; i++) {
  for(k = 0; k < 6-i; k++){
    output +=' '
  }
  for (j = 0; j < (2*i+1); j++){
    output += '*'  
  }
  output += '\n'
}

for (i = 0; i < 7; i++) {
  for(k = 0; k < i; k++){
    output +=' ' // 밑에 피라미드 앞쪽 공백
  }
  for (j = 0; j < 2* (6-i) +1; j++){
    output += '*'  
  }
  output += '\n'
}



console.log(output)

//        *
//       ***
//      *****
//     *******
//    *********
//   ***********  
//  ************* <- 위 코드로 ok
//   ***********  <- 여기서 부터 시작
//    *********   
//     *******
//      *****
//       ***
//        *